app/Http/Controllers/AnswersController.php

    public function destroy(Question $question, Answer $answer)
    {
        $this->authorize('delete', $answer);

        $answer->delete();
---
delete from `answers` where `id` = 179