app/Http/Controllers/AnswersController.php

update `answers` set `body` = '<b>hello</b> mello little fellow', `answers`.`updated_at` = '2021-06-01 20:08:16' where `id` = 199
---
    public function update(Request $request, Question $question, Answer $answer)
    {
        $this->authorize('update', $answer);

        $answer->update($request->validate([
            'body' => 'required',
        ]));

delete from `answers` where `id` = 194
---
    public function destroy(Question $question, Answer $answer)
    {
        $this->authorize('delete', $answer);

        $answer->delete();