app/Http/Controllers/FavouritesController.php

delete from `favourites` where `favourites`.`question_id` = 56 and `favourites`.`user_id` in (1)
---
    public function destroy(Question $question)
    {
        $question->favourites()->detach(Auth::user()->id);