app/Http/Controllers/QuestionsController.php

select * from `questions` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1, 17, 19, 20)
select count(*) as aggregate from `questions`
---
    public function index()
    {
        $questions = Question::with('user')->latest()->paginate(10);

update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2021-05-16 02:56:10' where `id` = 56
---
    public function show(Question $question)
    {
        $question->increment('views');

update `questions` set `body` = 'this is descripption updated', `questions`.`updated_at` = '2021-06-01 08:38:01' where `id` = 60
---
    public function update(AskQuestionRequest $request, Question $question)
    {
        $this->authorize('update', $question);

        $question->update($request->only('title', 'body'));

delete from `questions` where `id` = 60
---
    public function destroy(Question $question)
    {
        $this->authorize('delete', $question);

        $question->delete();