app/Models/Answer.php

    public static function boot()
    {
        parent::boot();
        static::created(function($answer)
        {
            $answer->question->increment('answers_count');
        });

        static::deleted(function($answer)
        {
            $answer->question->decrement('answers_count');
        });
---
update `questions` set `answers_count` = `answers_count` - 1, `questions`.`updated_at` = '2021-05-24 11:22:51' where `id` = 54
update `questions` set `answers_count` = `answers_count` + 1, `questions`.`updated_at` = '2021-05-31 12:40:14' where `id` = 59