app/Models/Question.php

    public function acceptBestAnswer(Answer $answer)
    {
        $this->best_answer_id = $answer->id;
        $this->save();
---
update `questions` set `best_answer_id` = 193, `questions`.`updated_at` = '2021-05-26 19:15:16' where `id` = 59