app/Models/User.php

update `votables` set `vote` = -1 where `votables`.`user_id` = 1 and `votable_type` = 'App\Models\Answer' and `votable_id` in (171)
insert into `votables` (`user_id`, `votable_id`, `votable_type`, `vote`) values (1, 192, 'App\Models\Answer', 1)
---
    private function _vote($ralationship, $model, $vote)
    {
        if ($ralationship->where('votable_id', $model->id)->exists()) {
            $ralationship->updateExistingPivot($model, ['vote' => $vote]);
        }
        else {
            $ralationship->attach($model, ['vote' => $vote]);