app/Providers/RouteServiceProvider.php

select * from `answers` where `answers`.`question_id` in (56) order by `votes_count` desc
select * from `questions` where `slug` = 'suscipit-optio-corporis-quisquam-quaerat' limit 1
select * from `users` where `users`.`id` in (2, 4, 6, 7, 10)
---
    public function boot()
    {
        Route::bind('slug', function($slug){
            // return Question::with(['answers.user', 'answers' => function($query) {
            //     $query->orderBy('votes_count', 'DESC');
            // }])->where('slug', $slug)->first() ?? abort(404);
            return Question::with(['user', 'answers.user'])->where('slug', $slug)->first() ?? abort(404);

        });